Revit 2026 API

# ElementLogicalFilter Class

---

A filter used to logically combine two or more filters.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementLogicalFilter Autodesk.Revit.DBLogicalAndFilter Autodesk.Revit.DBLogicalOrFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementLogicalFilter : ElementFilter
```
```vb
Public Class ElementLogicalFilter
	Inherits ElementFilter
```
```cpp
public ref class ElementLogicalFilter : public ElementFilter
```
```fsharp
type ElementLogicalFilter =
    class
        inherit ElementFilter
    end
```

The ElementLogicalFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFilters | Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | SetFilters |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.

#### Reference

Autodesk.Revit.DB Namespace